#include "utils.h"

const char ArrSection[MAX_ARRSECTION][SECTION_SIZE] = {
   "Время",
   "ЭТР",
   "Перегрузка по току",
   "Перекос тока",
   "Перенапряжение",
   "Холостой Ход",
   "Низкое напряжение",
   "Температура",
   "ПЧ",
   "ПИД",
   "Ограничение пускового тока",
   "Подхват частоты",
   "ТИТ",
   "АО",
   "ТИИ",
   "MOTOR",
   "Fmin",
   "Fmid",
   "Fmax",
   "Fmid point",
   "Старт-частота(Гц)",
   "Разгон(Гц/c)",
   "Торможение(Гц/с)",
   "S х-ка разгона(с)",
   "S х-ка торможения(с)",
   "Номер U(F)",
   "Источник частоты: 0-MB,1-ТИТ1,2-ТИТ2",
   "Контекст",
   "Счетчики событий",
   "ARH(интервал, мин)",
   "ARH",
   "ДИНАМОГР",
   "ДИНАМОГР АВАР",
   "ДИНАМОГР АЛГ",
   "GSM",
   "Modbus адрес",
};

const TParamItem ParamItem[MAX_PARAM_ITEM] = {
   "Секунды(0-59)", 10, UINT, 255, 1, false, 0,
   "Минуты(0-59)", 11, UINT, 255, 1, false, 0,
   "Часы(0-23)", 12, UINT, 255, 1, false, 0,
   "День(1-31)", 13, UINT, 255, 1, false, 0,
   "Месяц(1-12)", 14, UINT, 255, 1, false, 0,
   "Год(+2000)", 15, UINT, 255, 1, false, 0,
   "Вторая точка частотной корректировки тока(Гц)", 20, REAL, 255, 1, false, 1,
   "Третья точка частотной корректировки тока(Гц)", 22, REAL, 255, 1, false, 1,
   "Первый поправочный коэффициент тока(%)", 24, REAL, 255, 1, false, 1,
   "Второй поправочный коэффициент тока(%)", 26, REAL, 255, 1, false, 1,
   "Третий поправочный коэффициент тока(%)", 28, REAL, 255, 1, false, 1,
   "Четвертый поправочный коэффициент тока(%)", 30, REAL, 255, 1, false, 1,
   "Аварийная уставка относительно Iном(%)", 32, UINT, 255, 1, false, 1,
   "Процент относительно аварийного счетчика ЭТР, позволяющий возобновить работу", 33, UINT, 255, 1, false, 1,
   "Аварийная уставка по времени(с)", 34, UINT, 255, 1, false, 1,
   "Наличие внешнего охлаждения: 0-нет, 1-есть ", 35, UINT, 255, 1, false, 1,
   "Состояние защиты: 0-выкл, 1-вкл, 2-сброс счетчика ", 36, UINT, 255, 1, false, 1,
   "Дейстующее значение тока(%) от ном", 52, UINT, 255, 1, false, 2,
   "Время удержания действующего значения тока(мс)", 53, UINT, 255, 1, false, 2,
   "Max значение счетчика АПВ", 54, UINT, 255, 1, false, 2,
   "Время декрементирования счетчика АПВ(мин)", 55, UINT, 255, 1, false, 2,
   "Величина тока обрыва фазы(%) от ном", 56, UINT, 255, 1, false, 3,
   "Время удержания обрыва фазы(мс)", 57, UINT, 255, 1, false, 3,
   "Дисбаланс тока(%) от ном", 58, UINT, 255, 1, false, 3,
   "Время удержания дисбаланса тока(мс)", 59, UINT, 255, 1, false, 3,
   "Max значение счетчика АПВ", 60, UINT, 255, 1, false, 3,
   "Время декрементирования счетчика АПВ(мин)", 61, UINT, 255, 1, false, 3,
   "Max значение счетчика АПВ", 62, UINT, 255, 1, false, 4,
   "Время декрементирования счетчика АПВ(мин)", 63, UINT, 255, 1, false, 4,
   "Активная мощность(Вт)", 64, UINT, 255, 1, false, 5,
   "Время удержания(с)", 65, UINT, 255, 1, false, 5,
   "Max значение счетчика АПВ", 66, UINT, 255, 1, false, 5,
   "Время декрементирования счетчика АПВ(мин)", 67, UINT, 255, 1, false, 5,
   "Max значение счетчика АПВ", 68, UINT, 255, 1, false, 1,
   "Время декрементирования счетчика АПВ(мин)", 69, UINT, 255, 1, false, 1,
   "Max значение счетчика АПВ", 70, UINT, 255, 1, false, 6,
   "Время декрементирования счетчика АПВ(мин)", 71, UINT, 255, 1, false, 6,
   "Разрешение работы в этом режиме(>0-разрешено)", 72, UINT, 255, 1, false, 6,
   "Напряжение для перехода в режим РФЧ(фиксированной частоты)(В)", 73, UINT, 255, 1, false, 6,
   "Время удержания напряжения(мс)", 74, UINT, 255, 1, false, 6,
   "Размах 100Гц гармоники для перехода в РФЧ(В)", 75, UINT, 255, 1, false, 6,
   "Время удержания размаха 100Гц гармоники(мс)", 76, UINT, 255, 1, false, 6,
   "Max частота в режиме РФЧ(Гц)", 77, UINT, 255, 1, false, 6,
   "Кол-во попыток выхода из РФЧ(0-сразу переход в аварию)", 78, UINT, 255, 1, false, 6,
   "Периодичность выхода из РФЧ(0-не выходить)(мин)", 79, UINT, 255, 1, false, 6,
   "Период сброса счетчика попыток выхода из РФЧ(0-не сбрасывать)(мин) ", 80, UINT, 255, 1, false, 6,
   "Max значение счетчика АПВ", 81, UINT, 255, 1, false, 7,
   "Время декрементирования счетчика АПВ(мин)", 82, UINT, 255, 1, false, 7,
   "Аварийная температура отсека конденсаторов(0С)", 83, UINT, 255, 1, false, 7,
   "Температура конденсаторов, допускающая возобновление работы(0С)", 84, UINT, 255, 1, false, 7,
   "Аварийная температура радиатора(0С)", 85, UINT, 255, 1, false, 7,
   "Температура радиатора, допускающая возобновление работы(0С)", 86, UINT, 255, 1, false, 7,
   "Частота для установки", 100, REAL, 255, 1, false, 8,
   "Стабилизация напряжения(>0-вкл)", 102, UINT, 255, 1, false, 8,
   "Направление вращения(0-по часовой,1-против)", 103, UINT, 255, 1, false, 8,
   "Останов двигателя по модбас в режиме ЧРЭП(>0)", 104, UINT, 255, 1, false, 8,
   "Задержка на включении после аварии в режимах ЧРЭП и КП(с)", 105, UINT, 255, 1, false, 8,
   "Задержка перед пуском в режиме КП(с)", 106, UINT, 255, 1, false, 8,
   "Сброс аварий(>0)", 107, UINT, 255, 1, false, 8,
   "Автономный режим работы: 0-ЧРЭП, 1-КП", 108, UINT, 255, 1, false, 8,
   "Температура вкл вентиляторов и ТУ3(0С)", 110, UINT, 255, 1, false, 8,
   "Гистерезис температуры вкл/выкл вентиляторов и ТУ3(0С)", 111, UINT, 255, 1, false, 8,
   "Режим отладочного порта:0 - отладка, 1 - ModBus Slave", 298, UINT, 255, 1, false, 8,
   "Номер контекста после пуска(1-10), 0 — пусковой и рабочий контекст совпадают", 132, UINT, 255, 1, false, 8,
   "Предельно допустимое увеличение частоты(Гц)", 112, UINT, 255, 1, false, 9,
   "Величина стабилизации мощности (Вт)", 114, REAL, 255, 1, false, 9,
   "Пропорциональный коэффициент", 116, REAL, 255, 1, false, 9,
   "Интегральный коэффициент", 118, REAL, 255, 1, false, 9,
   "Дифференциальный коэффициент", 120, REAL, 255, 1, false, 9,
   "Ограничение на Max изменение фазы напряжения", 122, REAL, 255, 1, false, 9,
   "Нижний предел отключения ПИД-регулятора(Вт)", 124, UINT, 255, 1, false, 9,
   "Верхний предел включения ПИД-регулятора(Вт)", 125, UINT, 255, 1, false, 9,
   "Величина игнорируемой входной ошибки(Вт)", 129, UINT, 255, 1, false, 9,
   "Ток увеличения частоты статора(А)", 126, UINT, 255, 1, false, 10,
   "Ток удержания частоты статора(А)", 127, UINT, 255, 1, false, 10,
   "Время удержания стартовой частоты статора(>0-вкл)(мс)", 128, UINT, 255, 1, false, 10,
   "Действующее напряжение «подхвата» вращающегося ротора(В)", 130, UINT, 255, 1, false, 11,
   "Разрешение «подхвата» вращающегося ротора(>0-вкл)", 131, UINT, 255, 1, false, 11,
   "Min частота, соотв min напряжению ТИТ1(Гц)", 140, UINT, 255, 1, false, 12,
   "Min частота, соотв min напряжению ТИТ2(Гц)", 141, UINT, 255, 1, false, 12,
   "Max частота, соотв max напряжению ТИТ1(Гц)", 142, UINT, 255, 1, false, 12,
   "Max частота, соотв max напряжению ТИТ2(Гц)", 143, UINT, 255, 1, false, 12,
   "Min напряжение ТИТ1(мВ)", 144, UINT, 255, 1, false, 12,
   "Min напряжение ТИТ2(мВ)", 145, UINT, 255, 1, false, 12,
   "Max напряжение ТИТ1(мВ)", 146, UINT, 255, 1, false, 12,
   "Max напряжение ТИТ2(мВ)", 147, UINT, 255, 1, false, 12,
   "Время усреднения ТИТ1(мс)", 148, UINT, 255, 1, false, 12,
   "Время усреднения ТИТ2(мс)", 149, UINT, 255, 1, false, 12,
   "Время усреднения ТИТ3(мс)", 150, UINT, 255, 1, false, 12,
   "Время усреднения ТИТ4(мс)", 151, UINT, 255, 1, false, 12,
   "ДжиттерРазница ТИТ1(мВ)", 152, UINT, 255, 1, false, 12,
   "ДжиттерРазница ТИТ2(мВ)", 153, UINT, 255, 1, false, 12,
   "Чувствительность ТИТ1(в 0,01 Гц)", 154, UINT, 255, 1, false, 12,
   "Чувствительность ТИТ2(в 0,01 Гц)", 155, UINT, 255, 1, false, 12,
   "Min значение измеряемой величины, соотв min напряжению AO1(мВ)", 160, REAL, 255, 1, false, 13,
   "Min значение измеряемой величины, соотв min напряжению AO2(мВ)", 162, REAL, 255, 1, false, 13,
   "Max значение измеряемой величины, соотв max напряжению AO1(мВ)", 164, REAL, 255, 1, false, 13,
   "Max значение измеряемой величины, соотв max напряжению AO2(мВ)", 166, REAL, 255, 1, false, 13,
   "Min напряжение AO1(мВ)", 168, UINT, 255, 1, false, 13,
   "Min напряжение AO2(мВ)", 169, UINT, 255, 1, false, 13,
   "Max напряжение AO1(мВ)", 170, UINT, 255, 1, false, 13,
   "Max напряжение AO2(мВ)", 171, UINT, 255, 1, false, 13,
   "Источник сигнала AO1: 0-выкл, 1-Fвых, 2-об/мин, 3-Pакт, 4-текущий момент", 172, UINT, 255, 1, false, 13,
   "Источник сигнала AO2: 0-выкл, 1-Fвых, 2-об/мин, 3-Pакт, 4-текущий момент", 173, UINT, 255, 1, false, 13,
   "ТИИ1", 180, UINT, 255, 1, false, 14,
   "ТИИ2", 181, UINT, 255, 1, false, 14,
   "ТИИ3", 182, UINT, 255, 1, false, 14,
   "ТИИ4", 183, UINT, 255, 1, false, 14,
   "ТИИ5", 184, UINT, 255, 1, false, 14,
   "ТИИ6", 185, UINT, 255, 1, false, 14,
   "ТИИ7", 186, UINT, 255, 1, false, 14,
   "ТИИ8", 187, UINT, 255, 1, false, 14,
   "ТИИ9", 188, UINT, 255, 1, false, 14,
   "ТИИ10", 189, UINT, 255, 1, false, 14,
   "ТИИ11", 190, UINT, 255, 1, false, 14,
   "ТИИ12", 191, UINT, 255, 1, false, 14,
   "ТИИ13", 192, UINT, 255, 1, false, 14,
   "ТИИ14", 193, UINT, 255, 1, false, 14,
   "ТИИ15", 194, UINT, 255, 1, false, 14,
   "Номинальный ток(А)", 200, REAL, 255, 1, false, 15,
   "Ток холостого хода(А)", 202, REAL, 255, 1, false, 15,
   "Номинальная скорость(об/мин)", 204, REAL, 255, 1, false, 15,
   "Номинальная частота(Гц)", 206, REAL, 255, 1, false, 15,
   "Номинальная мощность(Вт)", 208, REAL, 255, 1, false, 15,
   "КПД двигателя", 210, REAL, 255, 1, false, 15,
   "Min частота для установки Fmin(Гц)", 212, REAL, 255, 1, false, 15,
   "Max частота для установки Fmax(Гц)", 214, REAL, 255, 1, false, 15,
   "Количество полюсов", 296, UINT, 255, 1, false, 15,
   "Частота ШИМ (2-10 кГц)", 297, UINT, 255, 1, false, 15,
   "Характеристика U(f) №1: % напряжения от 380В в точке Fmin", 216, REAL, 255, 1, false, 16,
   "Характеристика U(f) №2: % напряжения от 380В в точке Fmin", 224, REAL, 255, 1, false, 16,
   "Характеристика U(f) №3: % напряжения от 380В в точке Fmin", 232, REAL, 255, 1, false, 16,
   "Характеристика U(f) №4: % напряжения от 380В в точке Fmin", 240, REAL, 255, 1, false, 16,
   "Характеристика U(f) №5: % напряжения от 380В в точке Fmin", 248, REAL, 255, 1, false, 16,
   "Характеристика U(f) №6: % напряжения от 380В в точке Fmin", 256, REAL, 255, 1, false, 16,
   "Характеристика U(f) №7: % напряжения от 380В в точке Fmin", 264, REAL, 255, 1, false, 16,
   "Характеристика U(f) №8: % напряжения от 380В в точке Fmin", 272, REAL, 255, 1, false, 16,
   "Характеристика U(f) №9: % напряжения от 380В в точке Fmin", 280, REAL, 255, 1, false, 16,
   "Характеристика U(f) №10: % напряжения от 380В в точке Fmin", 288, REAL, 255, 1, false, 16,
   "Характеристика U(f) №1: % напряжения от 380В в точке Fmid между Fmin и Fmax", 218, REAL, 255, 1, false, 17,
   "Характеристика U(f) №2: % напряжения от 380В в точке Fmid между Fmin и Fmax", 226, REAL, 255, 1, false, 17,
   "Характеристика U(f) №3: % напряжения от 380В в точке Fmid между Fmin и Fmax", 234, REAL, 255, 1, false, 17,
   "Характеристика U(f) №4: % напряжения от 380В в точке Fmid между Fmin и Fmax", 242, REAL, 255, 1, false, 17,
   "Характеристика U(f) №5: % напряжения от 380В в точке Fmid между Fmin и Fmax", 250, REAL, 255, 1, false, 17,
   "Характеристика U(f) №6: % напряжения от 380В в точке Fmid между Fmin и Fmax", 258, REAL, 255, 1, false, 17,
   "Характеристика U(f) №7: % напряжения от 380В в точке Fmid между Fmin и Fmax", 266, REAL, 255, 1, false, 17,
   "Характеристика U(f) №8: % напряжения от 380В в точке Fmid между Fmin и Fmax", 274, REAL, 255, 1, false, 17,
   "Характеристика U(f) №9: % напряжения от 380В в точке Fmid между Fmin и Fmax", 282, REAL, 255, 1, false, 17,
   "Характеристика U(f) №10: % напряжения от 380В в точке Fmid между Fmin и Fmax", 290, REAL, 255, 1, false, 17,
   "Характеристика U(f) №1: % напряжения от 380В в точке Fmax", 220, REAL, 255, 1, false, 18,
   "Характеристика U(f) №2: % напряжения от 380В в точке Fmax", 228, REAL, 255, 1, false, 18,
   "Характеристика U(f) №3: % напряжения от 380В в точке Fmax", 236, REAL, 255, 1, false, 18,
   "Характеристика U(f) №4: % напряжения от 380В в точке Fmax", 244, REAL, 255, 1, false, 18,
   "Характеристика U(f) №5: % напряжения от 380В в точке Fmax", 252, REAL, 255, 1, false, 18,
   "Характеристика U(f) №6: % напряжения от 380В в точке Fmax", 260, REAL, 255, 1, false, 18,
   "Характеристика U(f) №7: % напряжения от 380В в точке Fmax", 268, REAL, 255, 1, false, 18,
   "Характеристика U(f) №8: % напряжения от 380В в точке Fmax", 276, REAL, 255, 1, false, 18,
   "Характеристика U(f) №9: % напряжения от 380В в точке Fmax", 284, REAL, 255, 1, false, 18,
   "Характеристика U(f) №10: % напряжения от 380В в точке Fmax", 292, REAL, 255, 1, false, 18,
   "Характеристика U(f) №1: Fmid(Гц)", 222, REAL, 255, 1, false, 19,
   "Характеристика U(f) №2: Fmid(Гц)", 230, REAL, 255, 1, false, 19,
   "Характеристика U(f) №3: Fmid(Гц)", 238, REAL, 255, 1, false, 19,
   "Характеристика U(f) №4: Fmid(Гц)", 246, REAL, 255, 1, false, 19,
   "Характеристика U(f) №5: Fmid(Гц)", 254, REAL, 255, 1, false, 19,
   "Характеристика U(f) №6: Fmid(Гц)", 262, REAL, 255, 1, false, 19,
   "Характеристика U(f) №7: Fmid(Гц)", 270, REAL, 255, 1, false, 19,
   "Характеристика U(f) №8: Fmid(Гц)", 278, REAL, 255, 1, false, 19,
   "Характеристика U(f) №9: Fmid(Гц)", 286, REAL, 255, 1, false, 19,
   "Характеристика U(f) №10:Fmid(Гц)", 294, REAL, 255, 1, false, 19,
   "Контекст 1", 400, REAL, 255, 1, false, 20,
   "Контекст 2", 402, REAL, 255, 1, false, 20,
   "Контекст 3", 404, REAL, 255, 1, false, 20,
   "Контекст 4", 406, REAL, 255, 1, false, 20,
   "Контекст 5", 408, REAL, 255, 1, false, 20,
   "Контекст 6", 410, REAL, 255, 1, false, 20,
   "Контекст 7", 412, REAL, 255, 1, false, 20,
   "Контекст 8", 414, REAL, 255, 1, false, 20,
   "Контекст 9", 416, REAL, 255, 1, false, 20,
   "Контекст 10", 418, REAL, 255, 1, false, 20,
   "Контекст 1", 420, REAL, 255, 1, false, 21,
   "Контекст 2", 422, REAL, 255, 1, false, 21,
   "Контекст 3", 424, REAL, 255, 1, false, 21,
   "Контекст 4", 426, REAL, 255, 1, false, 21,
   "Контекст 5", 428, REAL, 255, 1, false, 21,
   "Контекст 6", 430, REAL, 255, 1, false, 21,
   "Контекст 7", 432, REAL, 255, 1, false, 21,
   "Контекст 8", 434, REAL, 255, 1, false, 21,
   "Контекст 9", 436, REAL, 255, 1, false, 21,
   "Контекст 10", 438, REAL, 255, 1, false, 21,
   "Контекст 1", 440, REAL, 255, 1, false, 22,
   "Контекст 2", 442, REAL, 255, 1, false, 22,
   "Контекст 3", 444, REAL, 255, 1, false, 22,
   "Контекст 4", 446, REAL, 255, 1, false, 22,
   "Контекст 5", 448, REAL, 255, 1, false, 22,
   "Контекст 6", 450, REAL, 255, 1, false, 22,
   "Контекст 7", 452, REAL, 255, 1, false, 22,
   "Контекст 8", 454, REAL, 255, 1, false, 22,
   "Контекст 9", 456, REAL, 255, 1, false, 22,
   "Контекст 10", 458, REAL, 255, 1, false, 22,
   "Контекст 1", 460, REAL, 255, 1, false, 23,
   "Контекст 2", 462, REAL, 255, 1, false, 23,
   "Контекст 3", 464, REAL, 255, 1, false, 23,
   "Контекст 4", 466, REAL, 255, 1, false, 23,
   "Контекст 5", 468, REAL, 255, 1, false, 23,
   "Контекст 6", 470, REAL, 255, 1, false, 23,
   "Контекст 7", 472, REAL, 255, 1, false, 23,
   "Контекст 8", 474, REAL, 255, 1, false, 23,
   "Контекст 9", 476, REAL, 255, 1, false, 23,
   "Контекст 10", 478, REAL, 255, 1, false, 23,
   "Контекст 1", 480, REAL, 255, 1, false, 24,
   "Контекст 2", 482, REAL, 255, 1, false, 24,
   "Контекст 3", 484, REAL, 255, 1, false, 24,
   "Контекст 4", 486, REAL, 255, 1, false, 24,
   "Контекст 5", 488, REAL, 255, 1, false, 24,
   "Контекст 6", 490, REAL, 255, 1, false, 24,
   "Контекст 7", 492, REAL, 255, 1, false, 24,
   "Контекст 8", 494, REAL, 255, 1, false, 24,
   "Контекст 9", 496, REAL, 255, 1, false, 24,
   "Контекст 10", 498, REAL, 255, 1, false, 24,
   "Контекст 1", 500, UINT, 255, 1, false, 25,
   "Контекст 2", 501, UINT, 255, 1, false, 25,
   "Контекст 3", 502, UINT, 255, 1, false, 25,
   "Контекст 4", 503, UINT, 255, 1, false, 25,
   "Контекст 5", 504, UINT, 255, 1, false, 25,
   "Контекст 6", 505, UINT, 255, 1, false, 25,
   "Контекст 7", 506, UINT, 255, 1, false, 25,
   "Контекст 8", 507, UINT, 255, 1, false, 25,
   "Контекст 9", 508, UINT, 255, 1, false, 25,
   "Контекст 10", 509, UINT, 255, 1, false, 25,
   "Контекст 1", 510, UINT, 255, 1, false, 26,
   "Контекст 2", 511, UINT, 255, 1, false, 26,
   "Контекст 3", 512, UINT, 255, 1, false, 26,
   "Контекст 4", 513, UINT, 255, 1, false, 26,
   "Контекст 5", 514, UINT, 255, 1, false, 26,
   "Контекст 6", 515, UINT, 255, 1, false, 26,
   "Контекст 7", 516, UINT, 255, 1, false, 26,
   "Контекст 8", 517, UINT, 255, 1, false, 26,
   "Контекст 9", 518, UINT, 255, 1, false, 26,
   "Контекст 10", 519, UINT, 255, 1, false, 26,
   "Источник контекста: 0-модбас, 1-ТС1", 520, UINT, 255, 1, false, 27,
   "Номер контекста при ТС1 разомкнут (TC1 - источник контекста)", 521, UINT, 255, 1, false, 27,
   "Номер контекста при ТС1 замкнут(TC1 - источник контекста)", 522, UINT, 255, 1, false, 27,
   "Номер контекста, когда источник контекста - модбас", 523, UINT, 255, 1, false, 27,
   "Время перехода между контекстами(В/с)", 524, UINT, 255, 1, false, 27,
   "Насыщение ключей", 800, UINT, 255, 1, false, 28,
   "Перенапряжений", 803, UINT, 255, 1, false, 28,
   "Аварий мгновенных токов Ia", 804, UINT, 255, 1, false, 28,
   "Аварий мгновенных токов Ib", 805, UINT, 255, 1, false, 28,
   "Аварий мгновенных токов Ic", 806, UINT, 255, 1, false, 28,
   "Аварий действующего значения тока", 807, UINT, 255, 1, false, 28,
   "Аварий ЭТР", 808, UINT, 255, 1, false, 28,
   "Обрывов фазы A", 809, UINT, 255, 1, false, 28,
   "Обрывов фазы B", 810, UINT, 255, 1, false, 28,
   "Обрывов фазы C", 811, UINT, 255, 1, false, 28,
   "Дисбалансов тока", 812, UINT, 255, 1, false, 28,
   "Аварий температуры отсека конденсаторов", 813, UINT, 255, 1, false, 28,
   "Аварий температуры радиатора", 814, UINT, 255, 1, false, 28,
   "Низкого напряжения DC-шины", 815, UINT, 255, 1, false, 28,
   "Холостой ход и превышение частоты", 818, UINT, 255, 1, false, 28,
   "adc_pwm_err", 819, UINT, 255, 1, false, 28,
   "adc_energy_err", 820, UINT, 255, 1, false, 28,
   "Перезагрузок по Watchdog timer ", 832, UINT, 255, 1, false, 28,
   "Перезагрузка ЧРЭП", 833, UINT, 255, 1, false, 28,
   "Отвод №1", 916, UINT, 255, 1, false, 29,
   "Отвод №2", 917, UINT, 255, 1, false, 29,
   "Отвод №3", 918, UINT, 255, 1, false, 29,
   "Отвод №4", 919, UINT, 255, 1, false, 29,
   "Отвод №5", 920, UINT, 255, 1, false, 29,
   "Отвод №6", 921, UINT, 255, 1, false, 29,
   "Отвод №7", 922, UINT, 255, 1, false, 29,
   "Отвод №8", 923, UINT, 255, 1, false, 29,
   "Отвод №9", 924, UINT, 255, 1, false, 29,
   "Замер Качаний СК", 925, UINT, 255, 1, false, 29,
   "Отвод №11", 926, UINT, 255, 1, false, 29,
   "Отвод №12", 927, UINT, 255, 1, false, 29,
   "Отвод №13", 928, UINT, 255, 1, false, 29,
   "Отвод №14", 929, UINT, 255, 1, false, 29,
   "Отвод №15", 930, UINT, 255, 1, false, 29,
   "Замер Электроэнергии", 931, UINT, 255, 1, false, 29,
   "Включение архивирования(>0)", 932, UINT, 255, 1, false, 30,
   "Включение формирования суммарного суточного замера по отводу(>0)", 933, UINT, 255, 1, false, 30,
   "Час формирования суммарного суточного замера по отводам", 934, UINT, 255, 1, false, 30,
   "Минута формирования суммарного суточного замера по отводам", 935, UINT, 255, 1, false, 30,
   "Секунда формирования суммарного суточного замера по отводам", 936, UINT, 255, 1, false, 30,
   "Смещение по времени формирования записей(+/-сек)", 937, INT, 255, 1, false, 30,
   "L1 горизонт(мм)", 11000, UINT, 255, 1, false, 31,
   "L2 вертикаль(мм)", 11001, UINT, 255, 1, false, 31,
   "L шатуна(мм)", 11002, UINT, 255, 1, false, 31,
   "Заднее плечо балансира(мм)", 11003, UINT, 255, 1, false, 31,
   "Переднее плечо балансира(мм)", 11004, UINT, 255, 1, false, 31,
   "Радиус кривошипа(мм)", 11005, UINT, 255, 1, false, 31,
   "Задержка снятия очередной динамогр(сек)", 11006, UINT, 255, 1, false, 31,
   "Тайм-аут сигнала оборота(сек)", 11007, UINT, 255, 1, false, 31,
   "Защита от дребезга сигнала оборота(циклы ШИМ)", 11008, UINT, 255, 1, false, 31,
   "Min период между сигналами оборота(мс)", 11009, UINT, 255, 1, false, 31,
   "Усреднение ТИТ3(циклы ШИМ)", 11010, UINT, 255, 1, false, 31,
   "Коэфф (k, k*x+b) пересчета кода ТИТ3 в силу", 11011, REAL, 255, 1, false, 31,
   "Постоянная (b, k*x+b) пересчета кода ТИТ3 в силу", 11013, REAL, 255, 1, false, 31,
   "Авария по минимальной нагрузке с динамографа", 11015, REAL, 255, 1, false, 32,
   "Авария по максимальной нагрузке с динамографа", 11017, REAL, 255, 1, false, 32,
   "Время удержания по аварии с динамографа(мс,0-выкл)", 11019, UINT, 255, 1, false, 32,
   "Max значение счетчика АПВ", 87, UINT, 255, 1, false, 32,
   "Время декрементирования счетчика АПВ(мин)", 88, UINT, 255, 1, false, 32,
   "Допустимый процент проскальзывания", 11046, UINT, 255, 1, false, 32,
   "Время автозапуска после аварии по усилию(мин)", 11040, UINT, 255, 1, false, 32,
   "Компенсация скольжения коэфф", 11047, REAL, 255, 1, false, 32,
   "Компенсация скольжения пост", 11049, REAL, 255, 1, false, 32,
   "Минимальная частота алгоритма динамографа", 11020, REAL, 255, 1, false, 33,
   "Стартовая частота алгоритма динамографа", 11022, REAL, 255, 1, false, 33,
   "Максимальная частота алгоритма динамографа", 11024, REAL, 255, 1, false, 33,
   "Мин нагрузка включения понижения частоты(или уставка П-регулятора)", 11026, REAL, 255, 1, false, 33,
   "Мин нагрузка отключения понижения частоты", 11028, REAL, 255, 1, false, 33,
   "Изменение частоты(Гц)", 11030, REAL, 255, 1, false, 33,
   "Перемещение точки регулирования наполненности насоса", 11032, REAL, 255, 1, false, 33,
   "Усилие точки регулирования наполненности насоса", 11034, REAL, 255, 1, false, 33,
   "Кол-во динамограмм для регулирования наполненности насоса(0-откл)", 11036, UINT, 255, 1, false, 33,
   "Включение работы алгоритма:0-выкл,1-вкл,2-режим тестовой динамограммы", 11037, UINT, 255, 1, false, 33,
   "Коэффициент пропорциональности ПИД регулятора(0-выкл)", 11038, REAL, 255, 1, false, 33,
   "Тестовая динамограмма(квадрат)-минимальное перемещение", 11041, UINT, 255, 1, false, 33,
   "Тестовая динамограмма(квадрат)-максимальное перемещение", 11042, UINT, 255, 1, false, 33,
   "Тестовая динамограмма(квадрат)-минимальная нагрузка", 11043, UINT, 255, 1, false, 33,
   "Тестовая динамограмма(квадрат)-максимальная нагрузка", 11044, UINT, 255, 1, false, 33,
   "Количество отсчетов ШИМ тестовой динамограммы", 11045, UINT, 255, 1, false, 33,
   "IP0", 16000, UINT, 255, 1, false, 34,
   "IP1", 16001, UINT, 255, 1, false, 34,
   "IP2", 16002, UINT, 255, 1, false, 34,
   "IP3", 16003, UINT, 255, 1, false, 34,
   "UDP_PORT", 16004, UINT, 255, 1, false, 34,
   "NUMSELF", 16005, UINT, 255, 1, false, 34,
   "NUMSELF_CONTROL", 16006, UINT, 255, 1, false, 34,
   "время удержания сессии NAT", 16007, UINT, 255, 1, false, 34,
   "период контроля канала", 16008, UINT, 255, 1, false, 34,
   "таймаут на квитанцию", 16009, UINT, 255, 1, false, 34,
   "таймаут на квитанцию асинхронной передачи", 16010, UINT, 255, 1, false, 34,
   "Номер клиента асинхронной передачи", 16011, UINT, 255, 1, false, 34,
   "запрет асинхронной передачи 1-Запрет", 16012, UINT, 255, 1, false, 34,
   "индекс асинхронно переданного архива", 16013, UINT, 255, 1, false, 34,
   "Логин строка", 16014, STR, 255, 58, false, 34,
   "Modbus адрес", 0, UINT, 255, 1, false, 35,
};

const char ArrSection_1[MAX_ARRSECTION_1][SECTION_SIZE] = {
   "ТОКИ",
   "НАПРЯЖЕНИЯ",
   "МОЩНОСТЬ",
   "COS",
   "МОМЕНТ",
   "ТЕМПЕРАТУРА",
   "СОСТОЯНИЯ",
   "ЧАСТОТА",
   "ТЕКУЩИЕ ТИТ ТС ТУ",
   "ДИАГНОСТИКА RS232_485",
   "ДИАГНОСТИКА ПЕРИФЕРИИ",
   "Max время выполнения задачи",
   "ТЕКУЩИЕ ЗНАЧЕНИЯ ЭТР",
   "Текущий АПВ",
   "СОБЫТИЯ",
   "ДИНАМОГРАММА",
   "ДИНАМОГРАММА_ПАРАМЕТР",
   "ВАТГРАММА",
   "ПЕРЕМЕЩЕНИЕ",
   "ФАЗА",
   "ФАЗАВРЕМЯ",
   "ВЕРСИЯ",
};

const TParamItem ParamItem_1[MAX_PARAM_ITEM_1] = {
   "Сумма действующих значений фазных токов(А)", 600, REAL, 255, 1, false, 0,
   "Действующее значение тока Ia(A)", 602, REAL, 255, 1, false, 0,
   "Действующее значение тока Ib(А)", 604, REAL, 255, 1, false, 0,
   "Действующее значение тока Iс(А)", 606, REAL, 255, 1, false, 0,
   "Среднее значение действующих фазных напряжений(В) ", 608, REAL, 255, 1, false, 1,
   "Суммарная активная мощность(Вт)", 616, REAL, 255, 1, false, 2,
   "Активная мощность фазы А(Вт)", 618, REAL, 255, 1, false, 2,
   "Активная мощность фазы B(Вт)", 620, REAL, 255, 1, false, 2,
   "Активная мощность фазы C(Вт)", 622, REAL, 255, 1, false, 2,
   "Суммарная реактивная мощность(Вт)", 624, REAL, 255, 1, false, 2,
   "Реактивная мощность фазы A(Вт)", 626, REAL, 255, 1, false, 2,
   "Реактивная мощность фазы B(Вт)", 628, REAL, 255, 1, false, 2,
   "Реактивная мощность фазы C(Вт)", 630, REAL, 255, 1, false, 2,
   "Суммарная полная мощность(Вт)", 632, REAL, 255, 1, false, 2,
   "Полная мощность фазы A(Вт)", 634, REAL, 255, 1, false, 2,
   "Полная мощность фазы B(Вт)", 636, REAL, 255, 1, false, 2,
   "Полная мощность фазы C(Вт)", 638, REAL, 255, 1, false, 2,
   "Средний cosPhi", 640, REAL, 255, 1, false, 3,
   "cosPhi фазы A", 642, REAL, 255, 1, false, 3,
   "cosPhi фазы B", 644, REAL, 255, 1, false, 3,
   "cosPhi фазы C", 646, REAL, 255, 1, false, 3,
   "Среднее значение напряжения DC-шины(В)", 648, REAL, 255, 1, false, 1,
   "Номинальный момент(Н*м)", 650, REAL, 255, 1, false, 4,
   "Текущие обороты в минуту(с учетом скольжения)", 640, REAL, 255, 1, false, 4,
   "Текущий момент(Н*м)", 654, REAL, 255, 1, false, 4,
   "Процент от ном момента", 656, REAL, 255, 1, false, 4,
   "Температура блока конденсаторов(0C)", 658, INT, 255, 1, false, 5,
   "Температура радиатора(0С)", 659, INT, 255, 1, false, 5,
   "Аварийное слово-состояние №1", 660, UINT, 255, 1, false, 6,
   "Аварийное слово-состояние №2", 661, UINT, 255, 1, false, 6,
   "Мгновенная текущая выходная частота(x100)(Гц)", 662, UINT, 255, 1, false, 7,
   "Мгновенное напряжение на DC-шине(В)", 663, UINT, 255, 1, false, 1,
   "Max за период напряжение на DC-шине(В)", 664, UINT, 255, 1, false, 1,
   "Min за период напряжение на DC-шине(В)", 665, UINT, 255, 1, false, 1,
   "Пульсация напряжения DC-шины за период(В)", 666, INT, 255, 1, false, 1,
   "Максимальный мгновенный действующий фазный ток за период(А)", 667, UINT, 255, 1, false, 0,
   "Минимальный мгновенный действующий фазный ток за период(А)", 668, UINT, 255, 1, false, 0,
   "Пульсации мгновенного действующего фазного тока за период(А)", 669, INT, 255, 1, false, 0,
   "Температура внешнего датчика(0С)", 670, INT, 255, 1, false, 5,
   "Заданная выходная частота (x100)(Гц)", 671, UINT, 255, 1, false, 7,
   "Максимальный мгновенный фазный ток во время запуска двигателя(А)", 672, UINT, 255, 1, false, 0,
   "Мгновенное значение ТИТ1(0-4095)", 673, UINT, 255, 1, false, 8,
   "Мгновенное значение ТИТ2(0-4095)", 674, UINT, 255, 1, false, 8,
   "Мгновенное значение ТИТ3(0-4095)", 675, UINT, 255, 1, false, 8,
   "Мгновенное значение ТИТ4(0-4095)", 676, UINT, 255, 1, false, 8,
   "Размах 100Гц гармоники DC-шины(В)", 677, UINT, 255, 1, false, 1,
   "Текущее состояние ТС( бит0-ТС1 бит14-ТС15)", 678, UINT, 255, 1, false, 8,
   "Текущее состояние ТУ( бит0-ТУ1 бит3-ТУ4)", 679, UINT, 255, 1, false, 8,
   "Состояние динамогр(1-задержка,2-ожидание первого сигнала,3-второго)", 680, UINT, 255, 1, false, 6,
   "Код ошибки динамографа", 681, UINT, 255, 1, false, 6,
   "Текущий коэфф передачи двигатель/кривошип", 682, REAL, 255, 1, false, 6,
   "Изменение частоты алгоритма динамографа", 684, REAL, 255, 1, false, 6,
   "Текущее усилие на штанге", 686, REAL, 255, 1, false, 6,
   "Счетчик пакетов с неверной контрольной суммой", 704, UINT, 255, 1, false, 9,
   "Счетчик пакетов с неверной контрольной суммой", 700, UINT, 255, 1, false, 9,
   "Счетчик прерываний ошибки", 705, UINT, 255, 1, false, 9,
   "Счетчик прерываний ошибки", 701, UINT, 255, 1, false, 9,
   "Счетчик принятых по интервалу тишины пакетов", 706, UINT, 255, 1, false, 9,
   "Счетчик принятых по интервалу тишины пакетов", 702, UINT, 255, 1, false, 9,
   "Счетчик переданных пакетов", 707, UINT, 255, 1, false, 9,
   "Счетчик переданных пакетов", 703, UINT, 255, 1, false, 9,
   "Датчики температуры Кол-во ресетов во время работы ", 708, UINT, 255, 1, false, 10,
   "Датчики температуры Кол-во ошибок при инициализации", 709, UINT, 255, 1, false, 10,
   "Датчики температуры Кол-во ошибок контрольной суммы", 710, UINT, 255, 1, false, 10,
   "Датчики температуры Счетчик успешных попыток чтения", 711, UINT, 255, 1, false, 10,
   "FRAM Кол-во ошибок чтения", 712, UINT, 255, 1, false, 10,
   "FRAM Кол-во ошибок записи", 713, UINT, 255, 1, false, 10,
   "чтения температуры(мс)", 714, UINT, 255, 1, false, 11,
   "чтения времени(мс)", 715, UINT, 255, 1, false, 11,
   "вычисления энергетических параметров(мс)", 716, UINT, 255, 1, false, 11,
   "matlab-задачи(мс)", 717, UINT, 255, 1, false, 11,
   "modBus-задачи(мс)", 718, UINT, 255, 1, false, 11,
   "Кол-во ошибок совместной работы ШИМ и АЦП", 719, UINT, 255, 1, false, 10,
   "Кол-во ошибок вычисления энергетических параметров за период", 720, UINT, 255, 1, false, 10,
   "Вычисленный ток с учетом частоты(А)", 721, UINT, 255, 1, false, 12,
   "Ток уставки из I^2*T(А)", 722, UINT, 255, 1, false, 12,
   "Порог срабатывания защиты I^2*T деленный на 100 ", 723, UINT, 255, 1, false, 12,
   "Процент текущего счетчика ЭТР относительно срабатывания защиты", 724, UINT, 255, 1, false, 12,
   "по току", 735, UINT, 255, 1, false, 13,
   "по перекосу тока", 736, UINT, 255, 1, false, 13,
   "по перенапряжению", 737, UINT, 255, 1, false, 13,
   "по холстому ходу и превышению частоты ", 738, UINT, 255, 1, false, 13,
   "по ЭТР", 739, UINT, 255, 1, false, 13,
   "по низкому напряжению", 740, UINT, 255, 1, false, 13,
   "по температуре", 741, UINT, 255, 1, false, 13,
   "Текущий счетчик АПС", 742, UINT, 255, 1, false, 13,
   "WiFi Счетчик прерываний ошибки", 743, UINT, 255, 1, false, 10,
   "WiFi Счетчик принятых пакетов", 744, UINT, 255, 1, false, 10,
   "WiFi Счетчик переданных пакетов", 745, UINT, 255, 1, false, 10,
   "БВИ(мс)", 746, UINT, 255, 1, false, 11,
   "счетчика активной мощности(мс)", 747, UINT, 255, 1, false, 11,
   "ТИИ(мс)", 736, UINT, 255, 1, false, 11,
   "АПС(мс)", 749, UINT, 255, 1, false, 11,
   "WIFI(мс)", 750, UINT, 255, 1, false, 11,
   "расчета динамограммы(мс)", 751, UINT, 255, 1, false, 11,
   "по динамографу", 752, UINT, 255, 1, false, 13,
   "ПротоколСобытий текущийИндекс в контроллере", 999, UINT, 255, 1, false, 14,
   "АрхивТИИ текущий Индекс в Контроллере", 3999, UINT, 255, 1, false, 14,
   "Dyn", 20000, UINT, 255, 427, false, 15,
   "Максимальное усилие(кг)", 32672, UINT, 255, 1, false, 16,
   "Минимальное усилие(кг)", 32673, UINT, 255, 1, false, 16,
   "Длина качка(мм)", 32674, UINT, 255, 1, false, 16,
   "Период качка(сек*100)", 32675, UINT, 255, 1, false, 16,
   "Wat", 12000, INT, 255, 200, false, 17,
   "Wat", 12200, INT, 255, 200, false, 18,
   "Wat", 12400, REAL, 255, 200, false, 19,
   "Wat", 12800, REAL, 255, 200, false, 20,
   "ВерсияПО", 10000, STR, 255, 40, false, 21,
};

const char AVAR_1[] = "Перегруз по мгновенному току";
const char AVAR_1_4[] = "  - Мгновенный ток по фазе А(А): ";
const char AVAR_1_5[] = "  - Мгновенный ток по фазе B(А): ";
const char AVAR_1_6[] = "  - Мгновенный ток по фазе C(А): ";
const char AVAR_1_7[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_1_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_1_9[] = "  - Мгновенная активная мощность(кВт): ";
const char AVAR_2[] = "Перегруз по действующему значению тока";
const char AVAR_2_4[] = "  - Мгновенный ток по фазе А(А): ";
const char AVAR_2_5[] = "  - Мгновенный ток по фазе B(А): ";
const char AVAR_2_6[] = "  - Мгновенный ток по фазе C(А): ";
const char AVAR_2_7[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_2_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_2_9[] = "  - Мгновенная активная мощность(кВт): ";
const char AVAR_3[] = "Авария по насыщению силовых ключей";
const char AVAR_3_4[] = "  - Мгновенный ток по фазе А(А): ";
const char AVAR_3_5[] = "  - Мгновенный ток по фазе B(А): ";
const char AVAR_3_6[] = "  - Мгновенный ток по фазе C(А): ";
const char AVAR_3_7[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_3_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_3_9[] = "  - Мгновенная активная мощность(кВт): ";
const char AVAR_4[] = "Перенапряжение DC-шины";
const char AVAR_4_5[] = "  - Установленная  выходная частота(Гц): ";
const char AVAR_4_6[] = "  - Текущая выходная частота(Гц): ";
const char AVAR_4_7[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_4_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_4_9[] = "  - Мгновенная активная мощность(кВт): ";
const char AVAR_5[] = "Перегрузка двигателя по ЭТР";
const char AVAR_5_4[] = "  - Температура конденсатора(0С): ";
const char AVAR_5_5[] = "  - Температура радиатора(0С): ";
const char AVAR_5_6[] = "  - Температура внешнего датчика(0С): ";
const char AVAR_5_7[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_5_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_5_9[] = "  - Мгновенная активная мощность(кВт): ";
const char AVAR_6[] = "Обрыв фазы";
const char AVAR_6_4[] = "  - Действующее значение тока по фазе А(А): ";
const char AVAR_6_5[] = "  - Действующее значение тока по фазе B(А): ";
const char AVAR_6_6[] = "  - Действующее значение тока по фазе C(А): ";
const char AVAR_6_7[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_6_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_6_9[] = "  - Размах мгновенного действующего тока за период выходной частоты(A): ";
const char AVAR_7[] = "Перекос тока";
const char AVAR_7_4[] = "  - Действующее значение тока по фазе А(А): ";
const char AVAR_7_5[] = "  - Действующее значение тока по фазе B(А): ";
const char AVAR_7_6[] = "  - Действующее значение тока по фазе C(А): ";
const char AVAR_7_7[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_7_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_7_9[] = "  - Размах мгновенного действующего тока за период выходной частоты(A): ";
const char AVAR_8[] = "Авария по датчикам температуры";
const char AVAR_8_4[] = "  - Температура конденсатора(0С): ";
const char AVAR_8_5[] = "  - Температура радиатора(0С): ";
const char AVAR_8_6[] = "  - Температура внешнего датчика(0С): ";
const char AVAR_8_7[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_8_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_8_9[] = "  - Мгновенная активная мощность(кВт): ";
const char AVAR_9[] = "Авария по низкому  мгновенному напряжению на DC-шине";
const char AVAR_9_4[] = "  - Действующее значение тока по фазе А(А): ";
const char AVAR_9_5[] = "  - Действующее значение тока по фазе B(А): ";
const char AVAR_9_6[] = "  - Действующее значение тока по фазе C(А): ";
const char AVAR_9_7[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_9_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_9_9[] = "  - Действующее значение напряжения на двигателе(В): ";
const char AVAR_10[] = "Авария по холостому ходу";
const char AVAR_10_4[] = "  - Действующее значение тока по фазе А(А): ";
const char AVAR_10_5[] = "  - Действующее значение тока по фазе B(А): ";
const char AVAR_10_6[] = "  - Действующее значение тока по фазе C(А): ";
const char AVAR_10_7[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_10_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_10_9[] = "  - Действующее значение активной мощности(кВт): ";
const char AVAR_11[] = "Авария по превышению выходной частоты в генераторном режиме";
const char AVAR_11_5[] = "  - Установленная  выходная частота(Гц): ";
const char AVAR_11_6[] = "  - Текущая выходная частота(Гц): ";
const char AVAR_11_7[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_11_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_11_9[] = "  - Мгновенная активная мощность(кВт): ";
const char AVAR_12[] = "Включение питания";
const char AVAR_13[] = "Выключение питания";
const char AVAR_14[] = "Пуск двигателя";
const char AVAR_14_4[] = "  - Источник пуска(1-ЧРЭП,2-КП,3-Ручной): ";
const char AVAR_15[] = "Останов двигателя";
const char AVAR_15_4[] = "  - Источник останова(1-ЧРЭП,2-КП,3-Ручной,4-модбас(ЧРЭП)): ";
const char AVAR_16[] = "Сброс ошибок";
const char AVAR_16_4[] = "  - Источник сброса(1-ТС1,2-модбас): ";
const char AVAR_16_6[] = "  - Аварийное слово-состояние №1 до сброса ошибки: ";
const char AVAR_16_8[] = "  - Аварийное слово-состояние №2 до сброса ошибки: ";
const char AVAR_17[] = "Изменение режима работы ЧРЭП";
const char AVAR_17_4[] = "  - Режим работы до(1-ЧРЭП,2-КП,3-Ручной): ";
const char AVAR_17_6[] = "  - Режим работы после(1-ЧРЭП,2-КП,3-Ручной): ";
const char AVAR_18[] = "Ошибки инициализации ЧРЭП";
const char AVAR_18_4[] = "  - Код ошибки: ";
const char AVAR_19[] = "Перезагрузка по сторожевому таймеру";
const char AVAR_19_4[] = "  - Источник перезагрузки(1-модбас,2-программная ошибка): ";
const char AVAR_19_6[] = "  - Счетчик ошибок совместной работы АЦП и ШИМ: ";
const char AVAR_19_8[] = "  - Счетчик ошибок вычисления энергетических параметров: ";
const char AVAR_20[] = "Сработала авария по удержанию пониженного напряжения DC-шины";
const char AVAR_20_4[] = "  - Q10, размах 100 Гц-гармоники(В): ";
const char AVAR_20_5[] = "  - Текущая выходная частота(Гц): ";
const char AVAR_20_6[] = "  - Размах мгновенного напряжения DC-шины за период выходной частоты/10(В): ";
const char AVAR_20_7[] = "  - Размах мгновенного действующего тока за период выходной частоты(А): ";
const char AVAR_20_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_20_9[] = "  - Действующее значение активной мощности(кВт): ";
const char AVAR_21[] = "Включен режим ограничения максимальной выходной частоты по удержанию пониженного напряжения DC-шины";
const char AVAR_21_4[] = "  - Q10, размах 100 Гц-гармоники(В): ";
const char AVAR_21_5[] = "  - Текущая выходная частота(Гц): ";
const char AVAR_21_6[] = "  - Размах мгновенного напряжения DC-шины за период выходной частоты(В): ";
const char AVAR_21_7[] = "  - Размах мгновенного действующего тока за период выходной частоты(А): ";
const char AVAR_21_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_21_9[] = "  - Действующее значение активной мощности(кВт): ";
const char AVAR_22[] = "Сработала авария по удержанию размаха 100Гц гармоники DC-шины";
const char AVAR_22_4[] = "  - Q10, размах 100 Гц-гармоники(В): ";
const char AVAR_22_5[] = "  - Текущая выходная частота(Гц): ";
const char AVAR_22_6[] = "  - Размах мгновенного напряжения DC-шины за период выходной частоты(В): ";
const char AVAR_22_7[] = "  - Размах мгновенного действующего тока за период выходной частоты(А): ";
const char AVAR_22_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_22_9[] = "  - Действующее значение активной мощности(кВт): ";
const char AVAR_23[] = "Включен режим ограничения максимальной выходной частоты по удержанию размаха 100Гц гармоники DC-шины";
const char AVAR_23_4[] = "  - Q10, размах 100 Гц-гармоники(В): ";
const char AVAR_23_5[] = "  - Текущая выходная частота(Гц): ";
const char AVAR_23_6[] = "  - Размах мгновенного напряжения DC-шины за период выходной частоты(В): ";
const char AVAR_23_7[] = "  - Размах мгновенного действующего тока за период выходной частоты(А): ";
const char AVAR_23_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_23_9[] = "  - Действующее значение активной мощности(кВт): ";
const char AVAR_24[] = "Авария по ограничению пускового тока";
const char AVAR_24_4[] = "  - Мгновенный ток по фазе А(А): ";
const char AVAR_24_5[] = "  - Мгновенный ток по фазе B(А): ";
const char AVAR_24_6[] = "  - Мгновенный ток по фазе C(А): ";
const char AVAR_24_7[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_24_8[] = "  - Мгновенное значение напряжения на DC-шине(В): ";
const char AVAR_24_9[] = "  - Мгновенная активная мощность(кВт): ";
const char AVAR_25[] = "Авария по датчику нагрузки";
const char AVAR_25_4[] = "  - Усилие на динамометре: ";
const char AVAR_25_6[] = "  - Установленная  выходная частота(Гц): ";
const char AVAR_25_7[] = "  - Текущая выходная частота(Гц): ";
const char AVAR_25_8[] = "  - Мгновенное среднее действующее значение тока(А): ";
const char AVAR_25_9[] = "  - Мгновенная активная мощность(кВт): ";
const char AVAR_110[] = "Количество качаний СК";
const char AVAR_110_4[] = "  - Интервал  замера (мин): ";
const char AVAR_110_6[] = "  - Количество качаний СК за интервал : ";
const char AVAR_102[] = "Архивная запись по отводу 2";
const char AVAR_102_4[] = "  - Время замера (мин): ";
const char AVAR_102_6[] = "  - Замер: ";
const char AVAR_103[] = "Архивная запись по отводу 3";
const char AVAR_103_4[] = "  - Время замера (мин): ";
const char AVAR_103_6[] = "  - Замер: ";
const char AVAR_104[] = "Архивная запись по отводу 4";
const char AVAR_104_4[] = "  - Время замера (мин): ";
const char AVAR_104_6[] = "  - Замер: ";
const char AVAR_105[] = "Архивная запись по отводу 5";
const char AVAR_105_4[] = "  - Время замера (мин): ";
const char AVAR_105_6[] = "  - Замер: ";
const char AVAR_106[] = "Архивная запись по отводу 6";
const char AVAR_106_4[] = "  - Время замера (мин): ";
const char AVAR_106_6[] = "  - Замер: ";
const char AVAR_107[] = "Архивная запись по отводу 7";
const char AVAR_107_4[] = "  - Время замера (мин): ";
const char AVAR_107_6[] = "  - Замер: ";
const char AVAR_108[] = "Архивная запись по отводу 8";
const char AVAR_108_4[] = "  - Время замера (мин): ";
const char AVAR_108_6[] = "  - Замер: ";
const char AVAR_109[] = "Архивная запись по отводу 9";
const char AVAR_109_4[] = "  - Время замера (мин): ";
const char AVAR_109_6[] = "  - Замер: ";
const char AVAR_101[] = "Архивная запись по отводу 1";
const char AVAR_101_4[] = "  - Время замера (мин): ";
const char AVAR_101_6[] = "  - Замер: ";
const char AVAR_111[] = "Архивная запись по отводу 11";
const char AVAR_111_4[] = "  - Время замера (мин): ";
const char AVAR_111_6[] = "  - Замер: ";
const char AVAR_112[] = "Архивная запись по отводу 12";
const char AVAR_112_4[] = "  - Время замера (мин): ";
const char AVAR_112_6[] = "  - Замер: ";
const char AVAR_113[] = "Архивная запись по отводу 13";
const char AVAR_113_4[] = "  - Время замера (мин): ";
const char AVAR_113_6[] = "  - Замер: ";
const char AVAR_114[] = "Архивная запись по отводу 14";
const char AVAR_114_4[] = "  - Время замера (мин): ";
const char AVAR_114_6[] = "  - Замер: ";
const char AVAR_116[] = "Счетчик  электроэнергии";
const char AVAR_116_4[] = "  - Время замера (мин): ";
const char AVAR_116_6[] = "  - Расход электроэнергии кВтЧас: ";
const char AVAR_115[] = "Архивная запись по отводу 15";
const char AVAR_115_4[] = "  - Время замера (мин): ";
const char AVAR_115_6[] = "  - Замер: ";
const char AVAR_NAN[] = "Неизвестный код архива" ;

void decodArhiv(int aCode)
{

  int8_t *pa;
  pa = (int8_t *)&ValData[0];

switch(aCode)
{
case 1:
        copy_P(HTMLString + strlen(HTMLString), AVAR_1);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_1_4);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[4]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_1_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_1_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_1_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_1_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_1_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 2:
        copy_P(HTMLString + strlen(HTMLString), AVAR_2);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_2_4);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[4]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_2_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_2_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_2_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_2_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_2_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 3:
        copy_P(HTMLString + strlen(HTMLString), AVAR_3);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_3_4);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[4]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_3_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_3_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_3_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_3_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_3_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 4:
        copy_P(HTMLString + strlen(HTMLString), AVAR_4);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_4_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_4_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_4_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_4_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_4_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 5:
        copy_P(HTMLString + strlen(HTMLString), AVAR_5);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_5_4);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[4]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_5_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_5_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_5_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_5_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_5_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 6:
        copy_P(HTMLString + strlen(HTMLString), AVAR_6);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_6_4);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[4]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_6_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_6_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_6_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_6_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_6_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 7:
        copy_P(HTMLString + strlen(HTMLString), AVAR_7);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_7_4);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[4]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_7_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_7_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_7_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_7_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_7_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 8:
        copy_P(HTMLString + strlen(HTMLString), AVAR_8);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_8_4);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[4]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_8_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_8_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_8_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_8_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_8_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 9:
        copy_P(HTMLString + strlen(HTMLString), AVAR_9);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_9_4);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[4]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_9_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_9_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_9_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_9_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_9_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 10:
        copy_P(HTMLString + strlen(HTMLString), AVAR_10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_10_4);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[4]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_10_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_10_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_10_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_10_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_10_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 11:
        copy_P(HTMLString + strlen(HTMLString), AVAR_11);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_11_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_11_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_11_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_11_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_11_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 12:
        copy_P(HTMLString + strlen(HTMLString), AVAR_12);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 13:
        copy_P(HTMLString + strlen(HTMLString), AVAR_13);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 14:
        copy_P(HTMLString + strlen(HTMLString), AVAR_14);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_14_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 15:
        copy_P(HTMLString + strlen(HTMLString), AVAR_15);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_15_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 16:
        copy_P(HTMLString + strlen(HTMLString), AVAR_16);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_16_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_16_6);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[3]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_16_8);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[4]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 17:
        copy_P(HTMLString + strlen(HTMLString), AVAR_17);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_17_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_17_6);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[3]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 18:
        copy_P(HTMLString + strlen(HTMLString), AVAR_18);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_18_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 19:
        copy_P(HTMLString + strlen(HTMLString), AVAR_19);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_19_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_19_6);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[3]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_19_8);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[4]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 20:
        copy_P(HTMLString + strlen(HTMLString), AVAR_20);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_20_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_20_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_20_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_20_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_20_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 21:
        copy_P(HTMLString + strlen(HTMLString), AVAR_21);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_21_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_21_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_21_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_21_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_21_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 22:
        copy_P(HTMLString + strlen(HTMLString), AVAR_22);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_22_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_22_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_22_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_22_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_22_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 23:
        copy_P(HTMLString + strlen(HTMLString), AVAR_23);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_23_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_23_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_23_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_23_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_23_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 24:
        copy_P(HTMLString + strlen(HTMLString), AVAR_24);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_24_4);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[4]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_24_5);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[5]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_24_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_24_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_24_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8] * 10);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_24_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 25:
        copy_P(HTMLString + strlen(HTMLString), AVAR_25);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_25_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2] * 2);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_25_6);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[6]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_25_7);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[7]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_25_8);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[8]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_25_9);
        sprintf(HTMLString + strlen(HTMLString), "%d", pa[9]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 110:
        copy_P(HTMLString + strlen(HTMLString), AVAR_110);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_110_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_110_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%f", val_DWord.Value * 0.5000);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 102:
        copy_P(HTMLString + strlen(HTMLString), AVAR_102);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_102_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_102_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 103:
        copy_P(HTMLString + strlen(HTMLString), AVAR_103);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_103_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_103_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 104:
        copy_P(HTMLString + strlen(HTMLString), AVAR_104);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_104_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_104_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 105:
        copy_P(HTMLString + strlen(HTMLString), AVAR_105);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_105_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_105_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 106:
        copy_P(HTMLString + strlen(HTMLString), AVAR_106);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_106_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_106_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 107:
        copy_P(HTMLString + strlen(HTMLString), AVAR_107);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_107_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_107_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 108:
        copy_P(HTMLString + strlen(HTMLString), AVAR_108);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_108_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_108_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 109:
        copy_P(HTMLString + strlen(HTMLString), AVAR_109);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_109_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_109_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 101:
        copy_P(HTMLString + strlen(HTMLString), AVAR_101);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_101_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_101_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 111:
        copy_P(HTMLString + strlen(HTMLString), AVAR_111);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_111_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_111_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 112:
        copy_P(HTMLString + strlen(HTMLString), AVAR_112);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_112_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_112_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 113:
        copy_P(HTMLString + strlen(HTMLString), AVAR_113);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_113_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_113_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 114:
        copy_P(HTMLString + strlen(HTMLString), AVAR_114);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_114_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_114_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 116:
        copy_P(HTMLString + strlen(HTMLString), AVAR_116);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_116_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_116_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%f", val_DWord.Value * 0.0010);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
case 115:
        copy_P(HTMLString + strlen(HTMLString), AVAR_115);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_115_4);
        sprintf(HTMLString + strlen(HTMLString), "%u", ValData[2]);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        copy_P(HTMLString + strlen(HTMLString), AVAR_115_6);
        val_DWord.Word[0] = ValData[3];
        val_DWord.Word[1] = ValData[4];
        sprintf(HTMLString + strlen(HTMLString), "%lu", val_DWord.Value);
        copy_P(HTMLString + strlen(HTMLString), html_br);
        break;
default:
        {
           copy_P(HTMLString + strlen(HTMLString), AVAR_NAN );
           break;
        }
}  // end switch
};
